---
kind: enumMember
id: F:Autodesk.Revit.DB.HiddenLineViewsType.VectorProcessing
enum: Autodesk.Revit.DB.HiddenLineViewsType
source: html/dce41548-8f37-e883-babe-feac3a9dd82d.htm
---
# Autodesk.Revit.DB.HiddenLineViewsType.VectorProcessing

The type of Hidden Line Views is Vector Processing (fast).